Revit 2027 API
ExternalDataManagerCommands.BuiltInExternalDataManagerCommands.PlaceInstance Property
 Place a external data into Revit model.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalDataManagerCommandId PlaceInstance { get; }
Public Shared ReadOnly Property PlaceInstance As ExternalDataManagerCommandId
	Get
public:
static property ExternalDataManagerCommandId^ PlaceInstance {
	ExternalDataManagerCommandId^ get ();
}
static member PlaceInstance : ExternalDataManagerCommandId with get
Property Value
ExternalDataManagerCommandId
See Also
Reference
ExternalDataManagerCommands.BuiltInExternalDataManagerCommands Class
Autodesk.Revit.UI Namespace